---
kind: type
id: T:Autodesk.Revit.DB.Analysis.EnergyAnalysisConstruction
source: html/81de66b3-0235-9d05-14ee-22bf2efac937.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisConstruction

Represent an analytical construction as a composite of layered materials.

## Syntax (C#)
```csharp
public class EnergyAnalysisConstruction : Element
```